app/controllers/contents_controller.rb

  def create
    @content = current_user.contents.build(content_params)

    respond_to do |format|
      if @content.save
---
INSERT INTO "contents" ("title", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test 3"], ["description", "info"], ["price", 30.0], ["user_id", 1], ["created_at", "2016-07-29 19:18:58.106578"], ["updated_at", "2016-07-29 19:18:58.106578"]]

  def update
    respond_to do |format|
      if @content.update(content_params)
---
UPDATE "contents" SET "description" = ?, "updated_at" = ? WHERE "contents"."id" = ?  [["description", "This is a modified test"], ["updated_at", "2016-07-29 16:45:40.930429"], ["id", 1]]

  def destroy
    @content.destroy
---
DELETE FROM "contents" WHERE "contents"."id" = ?  [["id", 2]]

    def set_content
      @content = Content.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", 2]]